Repository: Eugeneofficial/personal-planner-generator
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ru

source: Personal Planner Generator
ru: Генератор Персональных Ежедневников

source: Create Your Planner
ru: Создайте Свой Ежедневник

source: Settings
ru: Настройки

source: Templates
ru: Шаблоны

source: Home
ru: Главная

source: AI Suggestions
ru: ИИ Предложения

source: AI Model
ru: Модель ИИ

source: Configure API Keys
ru: Настроить API Ключи

source: Generate Planner
ru: Создать Ежедневник

source: Privacy
ru: Конфиденциальность

source: Terms
ru: Условия

source: Help
ru: Помощь

source: Customize Your Planner
ru: Настройте Свой Ежедневник

source: Planner Name
ru: Название Ежедневника

source: My Personal Planner
ru: Мой Персональный Ежедневник

source: Planner Size
ru: Размер Ежедневника

source: Letter (8.5 × 11 in)
ru: Letter (8.5 × 11 дюймов)

source: Orientation
ru: Ориентация

source: Portrait
ru: Портретная

source: Landscape
ru: Альбомная

source: Start Date
ru: Дата Начала

source: End Date
ru: Дата Окончания

source: Cover Image (Optional)
ru: Изображение Обложки (Опционально)

source: Planner Components
ru: Компоненты Ежедневника

source: Yearly Overview
ru: Годовой Обзор

source: Monthly Calendars
ru: Месячные Календари

source: Weekly Planners
ru: Недельные Планировщики

source: Daily Pages
ru: Ежедневные Страницы

source: Goal Trackers
ru: Трекеры Целей

source: Note Pages
ru: Страницы для Заметок

source: Design Options
ru: Параметры Дизайна

source: Color Scheme
ru: Цветовая Схема

source: Blue
ru: Синий

source: Purple
ru: Фиолетовый

source: Green
ru: Зеленый

source: Pink
ru: Розовый

source: Minimalist Gray
ru: Минималистичный Серый

source: Font Style
ru: Стиль Шрифта

source: Modern
ru: Современный

source: Classic
ru: Классический

source: Handwritten
ru: Рукописный

source: Minimalist
ru: Минималистичный

source: Layout Style
ru: Стиль Макета

source: Grid
ru: Сетка

source: Minimal
ru: Минимальный

source: Creative
ru: Творческий

source: Professional
ru: Профессиональный

source: Additional Elements
ru: Дополнительные Элементы

source: Inspirational Quotes
ru: Вдохновляющие Цитаты

source: Habit Tracker
ru: Трекер Привычек

source: Mood Tracker
ru: Трекер Настроения

source: Expense Tracker
ru: Трекер Расходов

source: Reading List
ru: Список Чтения

source: Hold Ctrl/Cmd to select multiple options
ru: Удерживайте Ctrl/Cmd для выбора нескольких опций

source: Personal Notes or Special Instructions
ru: Личные Заметки или Особые Инструкции

source: Any special requests or notes for your planner...
ru: Любые особые пожелания или заметки для вашего ежедневника...

source: Preview
ru: Предпросмотр

source: Select components and design options to get AI suggestions for your planner.
ru: Выберите компоненты и параметры дизайна, чтобы получить предложения ИИ для вашего ежедневника.

source: Get AI Suggestions
ru: Получить Предложения ИИ

source: Looking for inspiration? Check out our pre-designed templates.
ru: Ищете вдохновение? Ознакомьтесь с нашими готовыми шаблонами.

source: Business
ru: Бизнес

source: Academic
ru: Учебный

source: View All Templates
ru: Просмотреть Все Шаблоны

source: Planner Preview
ru: Предпросмотр Ежедневника

source: Generating preview...
ru: Создание предпросмотра...

source: Close
ru: Закрыть

source: Generating AI suggestions...
ru: Создание предложений ИИ...

source: Based on your selections, I recommend adding habit trackers and mood trackers to complement your weekly planners. This combination helps track progress on goals while monitoring emotional well-being.
ru: На основе ваших выборов, я рекомендую добавить трекеры привычек и настроения в дополнение к вашим недельным планировщикам. Эта комбинация помогает отслеживать прогресс в достижении целей, одновременно контролируя эмоциональное благополучие.

source: I notice you've selected a professional layout. Consider adding expense tracking to enhance your planner's functionality. This would complement your organizational style and provide valuable financial insights.
ru: Я заметил, что вы выбрали профессиональный макет. Рассмотрите возможность добавления отслеживания расходов для расширения функциональности вашего ежедневника. Это дополнит ваш организационный стиль и предоставит ценную финансовую информацию.

source: Your planner configuration would benefit from adding reading list pages. Based on your selections, you appear to value comprehensive organization, and this addition would help track your learning goals.
ru: Конфигурация вашего ежедневника выиграет от добавления страниц со списком чтения. Судя по вашим выборам, вы цените комплексную организацию, и это дополнение поможет отслеживать ваши цели в обучении.

source: Hey there! Your planner looks great, but it's missing something fun - how about adding inspirational quotes? They'll give you that extra motivation boost when you're planning your week!
ru: Привет! Ваш ежедневник выглядит отлично, но ему не хватает чего-то интересного - как насчет добавления вдохновляющих цитат? Они дадут вам дополнительный мотивационный импульс при планировании недели!

source: Apply
ru: Применить

source: Refresh
ru: Обновить

source: Suggestion applied successfully!
ru: Предложение успешно применено!

source: Monthly Calendar
ru: Месячный Календарь

source: Weekly Planner
ru: Недельный Планировщик

source: Daily Page
ru: Ежедневная Страница

source: Planner Templates
ru: Шаблоны Ежедневников

source: Choose from our professionally designed templates to get started quickly. Each template includes pre-configured components tailored for specific needs.
ru: Выберите один из наших профессионально разработанных шаблонов для быстрого начала. Каждый шаблон включает предварительно настроенные компоненты, адаптированные для конкретных потребностей.

source: Business Planner
ru: Бизнес Ежедневник

source: Designed for professionals with meetings, projects, and deadlines. Includes task prioritization and goal tracking.
ru: Разработан для профессионалов с встречами, проектами и сроками. Включает приоритизацию задач и отслеживание целей.

source: Weekly Schedule
ru: Недельное Расписание

source: Meeting Notes
ru: Заметки о Встречах

source: Project Tracker
ru: Трекер Проектов

source: Goal Setting
ru: Постановка Целей

source: Use This Template
ru: Использовать Этот Шаблон

source: Academic Planner
ru: Учебный Ежедневник

source: Perfect for students with classes, assignments, and study sessions. Includes grade tracking and semester planning.
ru: Идеально подходит для студентов с занятиями, заданиями и учебными сессиями. Включает отслеживание оценок и планирование семестра.

source: Class Schedule
ru: Расписание Занятий

source: Assignment Tracker
ru: Трекер Заданий

source: Study Log
ru: Журнал Учебы

source: Grade Tracker
ru: Трекер Оценок

source: Fitness Planner
ru: Фитнес Ежедневник

source: Track workouts, nutrition, and wellness goals. Includes progress tracking and meal planning sections.
ru: Отслеживайте тренировки, питание и цели по оздоровлению. Включает разделы для отслеживания прогресса и планирования питания.

source: Workout Log
ru: Журнал Тренировок

source: Meal Planner
ru: Планировщик Питания

source: Progress Tracker
ru: Трекер Прогресса

source: Water Intake
ru: Потребление Воды

source: Creative Planner
ru: Творческий Ежедневник

source: For artists, writers, and creators. Includes project tracking, idea collection, and inspiration sections.
ru: Для художников, писателей и творческих людей. Включает отслеживание проектов, сбор идей и разделы для вдохновения.

source: Project Timeline
ru: Временная Шкала Проекта

source: Idea Collection
ru: Коллекция Идей

source: Inspiration Board
ru: Доска Вдохновения

source: Creative Goals
ru: Творческие Цели

source: Mindfulness Planner
ru: Ежедневник Осознанности

source: Focus on mental health, gratitude, and self-care. Includes mood tracking and reflection prompts.
ru: Фокус на психическом здоровье, благодарности и заботе о себе. Включает отслеживание настроения и подсказки для размышлений.

source: Gratitude Journal
ru: Журнал Благодарности

source: Meditation Log
ru: Журнал Медитаций

source: Reflection Pages
ru: Страницы для Размышлений

source: Travel Planner
ru: Планировщик Путешествий

source: Plan trips, activities, and packing lists. Includes budget tracking and itinerary planning.
ru: Планируйте поездки, мероприятия и списки вещей. Включает отслеживание бюджета и планирование маршрута.

source: Itinerary
ru: Маршрут

source: Packing List
ru: Список Вещей

source: Budget Tracker
ru: Трекер Бюджета

source: Travel Journal
ru: Дневник Путешествий

source: Need a custom planner?
ru: Нужен индивидуальный ежедневник?

source: If none of these templates fit your needs, you can create a fully customized planner from scratch.
ru: Если ни один из этих шаблонов не соответствует вашим потребностям, вы можете создать полностью индивидуальный ежедневник с нуля.

source: Create Custom Planner
ru: Создать Индивидуальный Ежедневник

source: API Keys
ru: API Ключи

source: Language
ru: Язык

source: Appearance
ru: Внешний Вид

source: Configure AI Model API Keys
ru: Настройка API Ключей Моделей ИИ

source: To use AI features, you need to provide API keys for the AI models you want to use. Your API keys are stored securely and are only used to make requests to the respective AI services.
ru: Для использования функций ИИ вам необходимо предоставить API ключи для моделей ИИ, которые вы хотите использовать. Ваши API ключи хранятся в безопасности и используются только для запросов к соответствующим сервисам ИИ.

source: Configured
ru: Настроено

source: Not Configured
ru: Не Настроено

source: OpenAI API Key
ru: API Ключ OpenAI

source: Get your API key from
ru: Получите ваш API ключ от

source: Base URL (Optional)
ru: Базовый URL (Опционально)

source: Only change this if you're using a custom OpenAI-compatible API endpoint
ru: Изменяйте это только если вы используете пользовательскую конечную точку API, совместимую с OpenAI

source: Save
ru: Сохранить

source: Test
ru: Тест

source: Anthropic API Key
ru: API Ключ Anthropic

source: Only change this if you're using a custom Claude-compatible API endpoint
ru: Изменяйте это только если вы используете пользовательскую конечную точку API, совместимую с Claude

source: Google API Key
ru: API Ключ Google

source: Only change this if you're using a custom Gemini-compatible API endpoint
ru: Изменяйте это только если вы используете пользовательскую конечную точку API, совместимую с Gemini

source: LM Studio Server URL
ru: URL Сервера LM Studio

source: Enter the URL of your local LM Studio server. Make sure LM Studio is running with the server enabled.
ru: Введите URL вашего локального сервера LM Studio. Убедитесь, что LM Studio запущен с включенным сервером.

source: API Key (Optional)
ru: API Ключ (Опционально)

source: Leave empty for no authentication
ru: Оставьте пустым для работы без аутентификации

source: Only required if your LM Studio server is configured to use authentication
ru: Требуется только если ваш сервер LM Studio настроен на использование аутентификации

source: Test Connection
ru: Проверить Соединение

source: Language Settings
ru: Настройки Языка

source: Choose your preferred language for the application interface.
ru: Выберите предпочитаемый язык для интерфейса приложения.

source: English language
ru: Английский язык

source: Russian language
ru: Русский язык

source: Language changes will take effect immediately.
ru: Изменения языка вступят в силу немедленно.

source: Appearance Settings
ru: Настройки Внешнего Вида

source: Customize the look and feel of the application.
ru: Настройте внешний вид и ощущения от приложения.

source: Theme
ru: Тема

source: Light Mode
ru: Светлый Режим

source: Dark Mode
ru: Темный Режим

source: Accessibility
ru: Доступность

source: High Contrast Mode
ru: Режим Высокого Контраста

source: Font Size
ru: Размер Шрифта

source: Normal
ru: Нормальный

source: Large
ru: Большой

source: Larger
ru: Очень Большой

source: Notification
ru: Уведомление

source: Please configure API key for this provider in Settings
ru: Пожалуйста, настройте API ключ для этого провайдера в Настройках

source: AI model changed to
ru: Модель ИИ изменена на

source: Increase font size
ru: Увеличить размер шрифта

source: Decrease font size
ru: Уменьшить размер шрифта

source: Toggle high contrast
ru: Переключить высокий контраст

source: Toggle theme
ru: Переключить тему

source: Create beautiful, customized planners for your daily productivity with AI assistance
ru: Создавайте красивые, индивидуальные ежедневники для вашей ежедневной продуктивности с помощью ИИ
